{"is_self":true,"author":"lakattack0221","from":null,"archived":true,"id":"2uscs5","gilded":0,"name":"t3_2uscs5","link_flair_css_class":null,"saved":false,"over_18":false,"num_comments":92,"author_flair_css_class":null,"quarantine":false,"edited":false,"score":51,"stickied":false,"url":"http://www.reddit.com/r/pathofexile/comments/2uscs5/rpathofexile_suggestions_thread/","secure_media":null,"created":1423079204,"subreddit_id":"t5_2sf6m","from_kind":null,"from_id":null,"title":"r/PathofExile Suggestions Thread","secure_media_embed":{},"distinguished":"moderator","downs":0,"thumbnail":"self","domain":"self.pathofexile","hide_score":false,"media_embed":{},"subreddit":"pathofexile","created_utc":"1423079204","author_flair_text":null,"retrieved_on":1440926497,"ups":51,"media":null,"selftext":"Hey all,\n\nThis thread is meant for suggestions on improving our reddit community.  \n\n* What's awesome?\n* What needs improvement?\n* Should we consider any new rules/rule changes?\n* What are your general thoughts on the community?\n* What positive/negative trends have you noticed now/over time?\n\nSo please, provide your suggestions!  \n\nYour mod team thanks you.","permalink":"/r/pathofexile/comments/2uscs5/rpathofexile_suggestions_thread/","link_flair_text":null}
{"author":"lakattack0221","from":null,"is_self":true,"saved":false,"over_18":false,"author_flair_css_class":null,"num_comments":106,"archived":true,"id":"2j4dj3","gilded":0,"name":"t3_2j4dj3","link_flair_css_class":"meta","quarantine":false,"edited":1413218227,"score":34,"url":"http://www.reddit.com/r/pathofexile/comments/2j4dj3/status_of_the_sub_mod_selection/","secure_media":null,"from_kind":null,"created":1413216933,"subreddit_id":"t5_2sf6m","from_id":null,"stickied":false,"distinguished":"moderator","downs":0,"thumbnail":"self","title":"Status of the Sub / Mod Selection","secure_media_embed":{},"media_embed":{},"subreddit":"pathofexile","created_utc":"1413213333","author_flair_text":null,"domain":"self.pathofexile","hide_score":false,"media":null,"selftext":"Hey all,\n\nlakattack0221 here.  I've been an active moderator for about 7 months now, invited as a moderator by ZiggyD and the others when I wanted to chip in and help the community that I love.  Recently we've seen some changes that I want to explain, and I'd like get us moving in the right direction.  \n\n**Mod Selection**\n----------------------------\n\n**Let me start by apologizing to both our community and our mod team.**\n\nWhen ZiggyD and Fenrils stepped down, we were essentially down to two active moderators - grangelov and myself. Phenxx has a very busy schedule at times, and we have the understanding that he helps when he can (and usually does quite a bit!).  This is important as there has always been a flood of moderator activity which we were swamped with before these two gentlemen left.  When a few very heated posts made it to the top of our sub, the number of reports grew very quickly. \n\nEven before these two left, we were in need of moderators.  Following ZiggyD's method in the mod election thread, I moved towards finding those polite folks with a level head and a motivation to help the community:\n\n&gt; Update: It's pretty difficult to figure out a good way to select mods, a few people have brought up some valid concerns with the method put forward here. So what might happen is we'll use this post and your comments to select a list of people and we'll check out their post histories and contact them re: the position. \n\n\nAfter some searching, and lots(lots) of post history snooping, I came across these four fellas:\n\n* GoogaNautGod\n* Msmit71\n* MeanwhileInSAfrica\n* wickedwarren (**removed**)\n\nI talked with them, and invited them to be \"trial\" moderators of sorts.  All of the above folks showed a **strong eagerness to help, a willingness to follow our rules, and they just seemed like nice people**.  It should be noted that some of these folks might not be the most popular when compared to the streamers, however they exhibited a lot of the qualities that seemed necessary for moderation.  \n\nMy thinking was exactly in line with what ZiggyD suggested, in that the best folks for the job might be the most reserved and conservative in their expressed opinions.  Furthermore, it seemed that the community somewhat agreed that simply voting as a sub might not be the best method. \n\n&gt; Fully agree. Streamers will use it for promo. Others are constantly involved in drama, while it's entertainment for a day, they will be horrible mods. \n\n\n&gt; We might just use this post to farm candidate ideas, check their history, contact them and then chose that way. We'll factor in votes and people's comments in here as much as possible though.\n\nThe idea was to bring them in, get them familiar with the rules and philosophy we've moderated with, and see how they do.  After a period of time, we can decide to boot them, or keep them around. \n\n**I should say that I was probably too naive in thinking that our duties were pretty cut and dry, and did not need the involvement of the community once folks have chimed in their thoughts on the selection process.**  I should also note that, in the past, we've only had one moderator who was \"voted\" in - ZiggyD, but let's be honest - he always an awesome guy and that was an easy choice. By the way, thanks again for all your contributions /u/ZiggyDStarcraft !\n\n\n**Status of the Sub**\n----------------------------\n\nI want to first say that I'm open to both \"starting\" from scratch in the sense that we vote on the current selection of moderators, and that I'm willing to step down.  **I have loved this community since I started playing years ago and want to see it flourish more than anyone.**\n\nFurthermore, I want to hear everyone's thoughts on which rules they like, which they don't, which need tweaking, and what you believe our roles as moderators should be.\n\nLet's flesh out exactly what people want to see in this sub, from it's mods and it's rules.  \n\n**I'll keep this post up for 2 days**, and keep it focused on what you want to see in this sub (including mod additions/removals), and begin the discussion of current/future rules.  \n\n**In 2 days**, I'll start another thread completely devoted towards the current rules.  I will try to reply to as many comments as possible and invite the other mods to do the same.  \n\n\n**Final Thoughts**\n----------------------------\n\nIn my personal opinion, we lost some of our best folks here in the past couple weeks - folks who worked very hard to create a community that largely went unnoticed as mod activities generally do.  As POE has become more popular, we've seeing more complaints from redditors, more heated and bullying behavior, and in general - more reports.  I really want to keep the people who care most about the game and community around, as I believe these are the ones who will contribute the most towards it's success.  \n\nLet's try to keep in mind that we all want to see our community continue to grow and become better, and to minimize how aggressively we approach criticizing each other.\n\nThank you!\n\n**EDIT** - There's been a lot of discussion on /u/wickedwarren. Please take some time, review his history and give your feedback.  \n\n**EDIT 2** - I think there is some value in having periodic (every 4 months?) discussion on the sub about the direction and any rule changes.  Maybe a sticky for a day would be good.  Please give us your feedback!\n\n**EDIT 3** - wickedwarren is no longer a mod.  I made a mistake here and I take full responsibility.  I'm sorry!","retrieved_on":1441124974,"ups":34,"permalink":"/r/pathofexile/comments/2j4dj3/status_of_the_sub_mod_selection/","link_flair_text":"Meta"}
{"score_hidden":false,"author_flair_text":null,"created_utc":"1413139630","score":6,"ups":6,"controversiality":0,"edited":1413149996,"author_flair_css_class":null,"gilded":0,"subreddit_id":"t5_2sf6m","retrieved_on":1426562782,"downs":0,"subreddit":"pathofexile","name":"t1_cl7imwv","distinguished":"moderator","archived":false,"link_id":"t3_2izw9a","id":"cl7imwv","parent_id":"t3_2izw9a","author":"lakattack0221","body":"To be honest, it's hard to really see who's active and who isn't unless you're a mod.  Here's the official list.\n\n* **slowmyrole** - not active\n* **grangelov** - very active\n* **Phenxx** - usually active, but is away at the moment\n* **lakattack0221** - i'm very active myself although I've recently been away on business\n\n\n\n\nHere are the new mods I recently reviewed/vetted and invited last night:\n \n* **GoogaNautGod**\n* **Msmit71** \t\n* **MeanwhileInSAfrica** \n\n\nOnce things settle down, and we introduce a few more mods, I'll make a post introducing everyone, what they bring to the table, and our general thoughts on the direction of the sub. It's here that we'll bring up with the community potential rule changes as well as open the conversation to discuss new rules as well.\n\nZiggyD was a moderator before myself, and between him and Fenrils, I let them be the \"community managers\" so to speak as far as announcing things, opening discussion, etc.  \nHowever, there was always a lot of discussion between the moderators since I've been here.  The ones who are active, are very active and contribute a lot to the direction of the sub and how we moderate it, even if it's not immediately visible to the sub.\n\nWith ZiggyD and Fenrils stepping down, I'll likely start communicating with the sub directly now and pick up where they left off.  I'm very excited to work with the new mods and see what they can bring to the table.\n"}
{"gilded":0,"subreddit":"pathofexile","score":2,"ups":2,"archived":false,"score_hidden":false,"parent_id":"t1_cl89b2n","name":"t1_cl89hk8","author":"lakattack0221","id":"cl89hk8","downs":0,"body":"&gt; There was no interference between mods and the subreddit and it was working well even though we can't really see what's happening, but that just makes it even better.\n\nBesides periodic discussions on rules and such, this is what will happen. You have my word!\n\n&gt; If the community requires a change, I'm sure there will be a super upvoted post regarding the topic.\n\nThe only problem is that this isn't always the case.  Pictures and content that can be quickly enjoyed are viewed the most, and most quickly upvoted.  It's very easy for strong ideas to go by the wayside in how reddit determines visibility. ","retrieved_on":1426549798,"controversiality":0,"link_id":"t3_2j4dj3","author_flair_text":null,"edited":false,"created_utc":"1413214098","author_flair_css_class":null,"subreddit_id":"t5_2sf6m","distinguished":"moderator"}
{"parent_id":"t1_cl89l4k","score_hidden":false,"name":"t1_cl89o6u","author":"lakattack0221","id":"cl89o6u","gilded":0,"subreddit":"pathofexile","ups":3,"score":3,"archived":false,"edited":false,"created_utc":"1413214479","author_flair_css_class":null,"subreddit_id":"t5_2sf6m","distinguished":"moderator","downs":0,"retrieved_on":1426549712,"body":"&gt; If a topic is important/interesting/needed/etc it will be upvoted\n\nIt's not that good ideas won't get upvotes, but as the community grows and certain content becomes easier to consume (and appeals to a broader group of people), the \"quicker\" content tends to drown out the rest.  I've seen this many times personally. ","controversiality":0,"link_id":"t3_2j4dj3","author_flair_text":null}
{"archived":false,"ups":4,"score":4,"subreddit":"pathofexile","gilded":0,"id":"cl89s7v","name":"t1_cl89s7v","author":"lakattack0221","score_hidden":false,"parent_id":"t1_cl89no6","author_flair_text":null,"link_id":"t3_2j4dj3","retrieved_on":1426549660,"body":"&gt; Yea, but ideas that are downvoted are usually done for a reason.\n\nI'm really just talking about upvotes, and not downvotes.  Bad ideas will be downvoted, good ideas might not get the traction for everyone to see when other content is more available or has broader appeal. \n\nOn your other comment, I agree with you about the ratio.  I'll be sure to bring this up in the other thread on rule discussion.","controversiality":0,"downs":0,"distinguished":"moderator","subreddit_id":"t5_2sf6m","author_flair_css_class":null,"created_utc":"1413214711","edited":false}
{"gilded":0,"score":7,"ups":7,"archived":false,"subreddit":"pathofexile","id":"cl8a27x","author":"lakattack0221","name":"t1_cl8a27x","score_hidden":false,"parent_id":"t1_cl89wsl","downs":0,"author_flair_text":null,"link_id":"t3_2j4dj3","retrieved_on":1426549530,"controversiality":0,"body":"&gt; I don't really even care that the new mods were picked without the community being consulted - but they needed to blend in with the behind the scenes method of moderation that already existed. Now we're getting annoying and completely unnecessary tags on posts, and even more unneeded rule changes about self promotion?\n\nI absolutely agree with you. Changes should not have happened so quickly.  We've discussed this and we're all in agreement to stop all changes until we talk  more with the community and find out what everyone wants.\n\n&gt; This in particular: http://www.reddit.com/r/pathofexile/comments/2j2f1w/100_atziri_speed_runs/cl7r3we I have huge problems with and so should the rest of the mod team and community.\n\nI have a problem with this as well.  Let's make sure we discuss this in the other thread I'll make about the current rules. ","author_flair_css_class":null,"created_utc":"1413215292","edited":false,"distinguished":"moderator","subreddit_id":"t5_2sf6m"}
{"author_flair_text":null,"link_id":"t3_2j4dj3","controversiality":0,"retrieved_on":1426549526,"body":"&gt; Another weekly type post that would be great to see is a \"Stupid Questions\" thread (note I've never liked that title and would like to suggest something along the lines of \"Game Mechanics Question Thread\" since thats more open ended and won't make people feel stupid for posting their questions).\n\nWe actually used to do this.  I think it's an awesome idea and we'd all enjoy it so... let's do this again!","downs":0,"distinguished":"moderator","subreddit_id":"t5_2sf6m","author_flair_css_class":null,"created_utc":"1413215308","edited":false,"ups":10,"score":10,"archived":false,"subreddit":"pathofexile","gilded":0,"id":"cl8a2hx","author":"lakattack0221","name":"t1_cl8a2hx","score_hidden":false,"parent_id":"t1_cl89ud4"}
{"gilded":0,"subreddit":"pathofexile","archived":false,"ups":17,"score":17,"score_hidden":false,"parent_id":"t1_cl89uuc","name":"t1_cl8a8kc","author":"lakattack0221","id":"cl8a8kc","downs":0,"controversiality":0,"retrieved_on":1426549448,"body":"&gt; if he really did lots and lots of searching, like he said how did he not found this? and how he thinks wickedwarren is even a valid option for a mod position, if almost everthing he post is trash?\n\nI think I made a mistake, honestly. I looked over so many users over the past couple days, and... I think I just messed up. ","link_id":"t3_2j4dj3","author_flair_text":null,"edited":false,"created_utc":"1413215664","author_flair_css_class":null,"subreddit_id":"t5_2sf6m","distinguished":"moderator"}
{"edited":1413218039,"created_utc":"1413216924","author_flair_css_class":null,"subreddit_id":"t5_2sf6m","distinguished":"moderator","downs":0,"retrieved_on":1426549166,"body":"No worries, I understand. You did a good job of bringing this to our attention. Thank you for your hard work and taking the time to put this all together. \n\nWe removed his moderator duties.  \n\nOn another note... **HAPPY CAKE DAY!**","controversiality":0,"link_id":"t3_2j4dj3","author_flair_text":null,"score_hidden":false,"parent_id":"t1_cl8arq6","author":"lakattack0221","name":"t1_cl8aubt","id":"cl8aubt","gilded":0,"subreddit":"pathofexile","ups":8,"archived":false,"score":8}
{"id":"cl8b2lk","name":"t1_cl8b2lk","author":"lakattack0221","parent_id":"t1_cl8aa0h","score_hidden":false,"score":3,"ups":3,"archived":false,"subreddit":"pathofexile","gilded":0,"distinguished":"moderator","subreddit_id":"t5_2sf6m","author_flair_css_class":null,"created_utc":"1413217387","edited":false,"author_flair_text":null,"link_id":"t3_2j4dj3","retrieved_on":1426549059,"controversiality":0,"body":"All things considered, I still love the heck out of this community and want it to continue to grow and evolve :-)","downs":0}
{"score_hidden":false,"parent_id":"t1_cl89hd1","id":"cl8b400","author":"lakattack0221","name":"t1_cl8b400","subreddit":"pathofexile","archived":false,"ups":6,"score":6,"gilded":0,"distinguished":"moderator","subreddit_id":"t5_2sf6m","edited":1413218087,"author_flair_css_class":null,"created_utc":"1413217466","retrieved_on":1426549040,"body":"We've discussed this and you're right.  He should not have made such quick decisions on changes like that either (on the atziri post).\n\nwickedwarren has had his mod duties removed.","controversiality":0,"author_flair_text":null,"link_id":"t3_2j4dj3","downs":0}
{"subreddit_id":"t5_2sf6m","distinguished":"moderator","edited":false,"created_utc":"1413217591","author_flair_css_class":null,"retrieved_on":1426549012,"body":"&gt; We could have waited for you and helped you make these decisions. Going forward i would like to \"see\" the mod team more often. Perhaps utilize the sticky post feature to generate discussion more often.\n\nThanks for your input.  This is a great idea and we will do this going forward :-)\n\n&gt; I strongly feel the rules could be updated to filter out a lot of posts that end up just getting downvoted to nothingness.\n\nI agree.  Let's discuss this in a couple days and get everyone's input.","controversiality":0,"link_id":"t3_2j4dj3","author_flair_text":null,"downs":0,"score_hidden":false,"parent_id":"t1_cl8anfk","name":"t1_cl8b67r","author":"lakattack0221","id":"cl8b67r","subreddit":"pathofexile","ups":2,"score":2,"archived":false,"gilded":0}
{"author_flair_css_class":null,"author":"lakattack0221","subreddit":"pathofexile","archived":false,"score":4,"distinguished":"moderator","edited":false,"ups":4,"controversiality":0,"link_id":"t3_2j4dj3","gilded":0,"body":"&gt; I think these types of posts are acceptable if multiple pieces of evidence can be brought forward, with the caveat that if the majority of comments that are writtern in defense of the person being accused are downvoted heavily, then the thread can be deleted by mods on witchhunting grounds.\n\nI think this is a step in the right direction. Let's bring this up when we have our rule discussion in a few days.","score_hidden":false,"subreddit_id":"t5_2sf6m","id":"cl8bg4q","author_flair_text":null,"name":"t1_cl8bg4q","created_utc":"1413218144","downs":0,"retrieved_on":1426548812,"parent_id":"t1_cl8b2xt"}
{"ups":3,"downs":0,"created_utc":"1416261115","archived":false,"author_flair_css_class":null,"link_id":"t3_2mjfsf","edited":false,"score_hidden":false,"controversiality":0,"author_flair_text":null,"name":"t1_cm5cxn0","retrieved_on":1425977242,"id":"cm5cxn0","body":"Posting exactly how to exploit the game should be bannable in itself.  Was it necessary to outline exactly how you accomplished this via a reddit post?\n\nSpeaking as a mod, I think we should have a conversation about posts that do this.  It's one thing to talk about the personal impact to yourself, it's another to outline what you did to exploit the game.","parent_id":"t3_2mjfsf","gilded":0,"score":3,"subreddit_id":"t5_2sf6m","subreddit":"pathofexile","author":"lakattack0221","distinguished":"moderator"}
